assembly/subject2001.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>《Windows 核心编程》部分改编的汇编代码</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">《Windows 核心编程》部分改编的汇编代码</h1>
</header><div id="outline-container-orgf350e64" class="outline-2">
<h2 id="orgf350e64">专题内容</h2>
<div class="outline-text-2" id="text-orgf350e64">
<p>
原书作者： Jeffrey Richter.
</p>

<p>
原书名称： "Programming Applications for Microsoft Windows,Fourth Edition." 
</p>

<p>
中文译本： Windows 核心编程.(机械工业出版社）
</p>

<p>
专题目的： 用Masm32改写本书所有源代码.
</p>

<p>
专题说明： 为简单起见，大部分改写的源程序将暂时只保证在Win98上正确运行.也欢迎您贡献出自己的源代码.
</p>

<p>
专题日期： 2001.11.25&mdash;2002.??
</p>
</div>
</div>
<div id="outline-container-org9df7a02" class="outline-2">
<h2 id="org9df7a02">编程环境</h2>
<div class="outline-text-2" id="text-org9df7a02">
<p>
<a href="http://www.movsd.com/masm.htm">Masm32v7</a> <a href="./subject2001/headers.zip">头文件下载</a> (包含　<a href="./subject2001/CmnHdr.inc">CmnHdr.inc</a> <a href="./subject2001/Objects.INC">Objects.INC</a> <a href="./subject2001/Seh-2.inc">Seh-2.inc</a> ) 
</p>
</div>
</div>
<div id="outline-container-org6a578b7" class="outline-2">
<h2 id="org6a578b7">专题代码</h2>
<div class="outline-text-2" id="text-org6a578b7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Date</th>
<th scope="col" class="org-left">Describe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="./subject2000/17-MMFShare.zip">MMFShare</a></td>
<td class="org-right">2001.11.26</td>
<td class="org-left">a demo of Memory mapping file</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/26-CopyData.zip">CopyData</a></td>
<td class="org-right">2001.11.27</td>
<td class="org-left">a demo of WM<sub>COPYDATA</sub></td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/AppInst.zip">AppInst</a></td>
<td class="org-right">2001.11.28</td>
<td class="org-left">a demo of shared section in PE file.</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/Handshake.zip">Handshake</a></td>
<td class="org-right">2001.11.28</td>
<td class="org-left">a demo of use auto-reset event.</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/Summation.zip">Summation</a></td>
<td class="org-right">2001.12.19</td>
<td class="org-left">a demo of use SEH when stack overflow</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/23-SEHTerm.zip">SEHTerm</a></td>
<td class="org-right">2001.12.19</td>
<td class="org-left">a demo of use final Exception Handle</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/01-ErrorShow.zip">ErrorShow</a></td>
<td class="org-right">2001.12.27</td>
<td class="org-left">get text description for an error code</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/07-SchedLab.zip">SchedLab</a></td>
<td class="org-right">2001.12.27</td>
<td class="org-left">process and thread priority classes</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/10-swmrg.zip">SWMRG</a></td>
<td class="org-right">2001.12.27</td>
<td class="org-left">The Single Writer/Multiple Reader Guard</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/12-Counter.zip">Counter</a></td>
<td class="org-right">2001.12.27</td>
<td class="org-left">background processing using fibers</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/14-VMStat.zip">VMStat</a></td>
<td class="org-right">2001.12.27</td>
<td class="org-left">how to get Virtual Memory Status</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/15-MemReset.zip">MemReset</a></td>
<td class="org-right">2001.12.27</td>
<td class="org-left">change the protection attributes of pages</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/17-FileRev.zip">FileRev</a></td>
<td class="org-right">2002.02.04</td>
<td class="org-left">how to use memory-mapped files</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/09-Queue.zip">Queue</a></td>
<td class="org-right">2002.02.04</td>
<td class="org-left">how to uses a mutex and a semaphore</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/11-TimedMsgBox.zip">TimedMsgBox</a></td>
<td class="org-right">2002.02.05</td>
<td class="org-left">use the thread pool's timer functions</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/27-LISWatch.zip">LISWatch</a></td>
<td class="org-right">2002.02.05</td>
<td class="org-left">Local Input State Laboratory</td>
</tr>

<tr>
<td class="org-left"><a href="./subject2001/14-SysInfo.zip">SysInfo</a></td>
<td class="org-right">2002.02.06</td>
<td class="org-left">call GetSystemInfo,display info returned</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
